Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/dwdt.h
/* -------- DWDT_WDT1_VR : (DWDT Offset: 0x08) ( R/ 32) Watchdog 1 Value Register -------- */
#define DWDT_WDT1_VR_COUNTER_Pos              _UINT32_(0)                                          /* (DWDT_WDT1_VR) Watchdog Down Counter Value Position */
#define DWDT_WDT1_VR_COUNTER_Msk              (_UINT32_(0xFFF) << DWDT_WDT1_VR_COUNTER_Pos)        /* (DWDT_WDT1_VR) Watchdog Down Counter Value Mask */
#define DWDT_WDT1_VR_COUNTER(value)           (DWDT_WDT1_VR_COUNTER_Msk & (_UINT32_(value) << DWDT_WDT1_VR_COUNTER_Pos)) /* Assigment of value for COUNTER in the DWDT_WDT1_VR register */
#define DWDT_WDT1_VR_Msk                      _UINT32_(0x00000FFF)                                 /* (DWDT_WDT1_VR) Register Mask  */


/* -------- DWDT_WDT1_WL : (DWDT Offset: 0x0C) (R/W 32) Watchdog 1 Window Level Register -------- */
#define DWDT_WDT1_WL_PERIOD_Pos               _UINT32_(0)                                          /* (DWDT_WDT1_WL) Watchdog Period Position */
#define DWDT_WDT1_WL_PERIOD_Msk               (_UINT32_(0xFFF) << DWDT_WDT1_WL_PERIOD_Pos)         /* (DWDT_WDT1_WL) Watchdog Period Mask */
#define DWDT_WDT1_WL_PERIOD(value)            (DWDT_WDT1_WL_PERIOD_Msk & (_UINT32_(value) << DWDT_WDT1_WL_PERIOD_Pos)) /* Assigment of value for PERIOD in the DWDT_WDT1_WL register */
#define DWDT_WDT1_WL_RPTH_Pos                 _UINT32_(16)                                         /* (DWDT_WDT1_WL) Repeat Threshold Position */
#define DWDT_WDT1_WL_RPTH_Msk                 (_UINT32_(0xFFF) << DWDT_WDT1_WL_RPTH_Pos)           /* (DWDT_WDT1_WL) Repeat Threshold Mask */
#define DWDT_WDT1_WL_RPTH(value)              (DWDT_WDT1_WL_RPTH_Msk & (_UINT32_(value) << DWDT_WDT1_WL_RPTH_Pos)) /* Assigment of value for RPTH in the DWDT_WDT1_WL register */
#define DWDT_WDT1_WL_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (DWDT_WDT1_WL) Register Mask  */


/* -------- DWDT_WDT1_IL : (DWDT Offset: 0x10) (R/W 32) Watchdog 1 Interrupt Level Register -------- */
#define DWDT_WDT1_IL_LVLTH_Pos                _UINT32_(0)                                          /* (DWDT_WDT1_IL) Level Threshold Position */
#define DWDT_WDT1_IL_LVLTH_Msk                (_UINT32_(0xFFF) << DWDT_WDT1_IL_LVLTH_Pos)          /* (DWDT_WDT1_IL) Level Threshold Mask */
#define DWDT_WDT1_IL_LVLTH(value)             (DWDT_WDT1_IL_LVLTH_Msk & (_UINT32_(value) << DWDT_WDT1_IL_LVLTH_Pos)) /* Assigment of value for LVLTH in the DWDT_WDT1_IL register */
#define DWDT_WDT1_IL_PRESC_Pos                _UINT32_(16)                                         /* (DWDT_WDT1_IL) Prescaler Ratio Position */
#define DWDT_WDT1_IL_PRESC_Msk                (_UINT32_(0x7) << DWDT_WDT1_IL_PRESC_Pos)            /* (DWDT_WDT1_IL) Prescaler Ratio Mask */
#define DWDT_WDT1_IL_PRESC(value)             (DWDT_WDT1_IL_PRESC_Msk & (_UINT32_(value) << DWDT_WDT1_IL_PRESC_Pos)) /* Assigment of value for PRESC in the DWDT_WDT1_IL register */
#define   DWDT_WDT1_IL_PRESC_RATIO128_Val     _UINT32_(0x0)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 128.  */
#define   DWDT_WDT1_IL_PRESC_RATIO64_Val      _UINT32_(0x1)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 64.  */
#define   DWDT_WDT1_IL_PRESC_RATIO32_Val      _UINT32_(0x2)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 32.  */
#define   DWDT_WDT1_IL_PRESC_RATIO16_Val      _UINT32_(0x3)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 16.  */
#define   DWDT_WDT1_IL_PRESC_RATIO8_Val       _UINT32_(0x4)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 8.  */
#define   DWDT_WDT1_IL_PRESC_RATIO4_Val       _UINT32_(0x5)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 4.  */
#define   DWDT_WDT1_IL_PRESC_RATIO2_Val       _UINT32_(0x6)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 2.  */
#define   DWDT_WDT1_IL_PRESC_RATIO1_Val       _UINT32_(0x7)                                        /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 1.  */
#define DWDT_WDT1_IL_PRESC_RATIO128           (DWDT_WDT1_IL_PRESC_RATIO128_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 128. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO64            (DWDT_WDT1_IL_PRESC_RATIO64_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 64. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO32            (DWDT_WDT1_IL_PRESC_RATIO32_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 32. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO16            (DWDT_WDT1_IL_PRESC_RATIO16_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 16. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO8             (DWDT_WDT1_IL_PRESC_RATIO8_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 8. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO4             (DWDT_WDT1_IL_PRESC_RATIO4_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 4. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO2             (DWDT_WDT1_IL_PRESC_RATIO2_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 2. Position  */
#define DWDT_WDT1_IL_PRESC_RATIO1             (DWDT_WDT1_IL_PRESC_RATIO1_Val << DWDT_WDT1_IL_PRESC_Pos) /* (DWDT_WDT1_IL) The watchdog counter decreased when the prescaler reaches 1. Position  */
#define DWDT_WDT1_IL_Msk                      _UINT32_(0x00070FFF)                                 /* (DWDT_WDT1_IL) Register Mask  */


/* -------- DWDT_WDT1_IER : (DWDT Offset: 0x14) ( /W 32) Watchdog 1 Interrupt Enable Register -------- */
#define DWDT_WDT1_IER_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT1_IER) Overflow Period Interrupt Enable Position */
#define DWDT_WDT1_IER_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_IER_PERINT_Pos)          /* (DWDT_WDT1_IER) Overflow Period Interrupt Enable Mask */
#define DWDT_WDT1_IER_PERINT(value)           (DWDT_WDT1_IER_PERINT_Msk & (_UINT32_(value) << DWDT_WDT1_IER_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT1_IER register */
#define DWDT_WDT1_IER_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT1_IER) Reload Repeat Period Interrupt Enable Position */
#define DWDT_WDT1_IER_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT1_IER_RPTHINT_Pos)         /* (DWDT_WDT1_IER) Reload Repeat Period Interrupt Enable Mask */
#define DWDT_WDT1_IER_RPTHINT(value)          (DWDT_WDT1_IER_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT1_IER_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT1_IER register */
#define DWDT_WDT1_IER_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT1_IER) Interrupt Level Threshold Interrupt Enable Position */
#define DWDT_WDT1_IER_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_IER_LVLINT_Pos)          /* (DWDT_WDT1_IER) Interrupt Level Threshold Interrupt Enable Mask */
#define DWDT_WDT1_IER_LVLINT(value)           (DWDT_WDT1_IER_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT1_IER_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT1_IER register */
#define DWDT_WDT1_IER_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT1_IER) Reload Command Error Interrupt Enable Position */
#define DWDT_WDT1_IER_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT1_IER_RLDERR_Pos)          /* (DWDT_WDT1_IER) Reload Command Error Interrupt Enable Mask */
#define DWDT_WDT1_IER_RLDERR(value)           (DWDT_WDT1_IER_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT1_IER_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT1_IER register */
#define DWDT_WDT1_IER_Msk                     _UINT32_(0x00000027)                                 /* (DWDT_WDT1_IER) Register Mask  */


